%%%-------------------------------------------------------------------
%%% @doc
%%% module key handle
%%% @end
%%%-------------------------------------------------------------------
-module(key_handle).
%% export API functions
-export([handle/3]).
-include("protocol.hrl").

%%%===================================================================
%%% API
%%%===================================================================
%% @doc 领取奖励
handle(34567, State, [Key]) ->
    key:award(State, Key);

%% @doc 容错
handle(Code, _, Data) ->
    {error, Code, Data}.


