%%%-------------------------------------------------------------------
%%% @doc
%%% assets define
%%% @end
%%%-------------------------------------------------------------------

%% 资产表
%% assets =====> assets
-record(assets, {
    player_id = 0,                                    %% 玩家ID 
    gold = 0,                                         %% 元宝 
    silver = 0,                                       %% 银币 
    copper = 0,                                       %% 铜币 
    exp = 0                                           %% 经验 
}).

