%%%------------------------------------------------------------------
%%% @doc
%%% event define
%%% @end
%%%------------------------------------------------------------------
%% 触发器
-record(trigger, {
    name,                                             %% 触发器名字
    pure = false,                                     %% 回调是否不携带User
    module,                                           %% 回调模块名
    function,                                         %% 回调函数名
    args = []                                         %% 回调函数参数
}).

%% 事件,不满足情况可自行添加自定义事件
-record(event, {
    name,                                            %% 事件名字
    compare,                                         %% 比较模式
    target = 0,                                      %% 目标
    number = 0                                       %% 目标数量
}).
